In [78]:
import numpy as np

In [79]:
import pandas as pd
exam1 = [89,85,93,83]
labels  = ['Student A', 'Student B', 'Student C', 'Student D']

pd.Series(exam1,labels)

Student A    89
Student B    85
Student C    93
Student D    83
dtype: int64

In [80]:
pd.Series(exam1,labels)['Student D']

83

In [81]:
d = {s:p for s,p in zip(labels,exam1)}
d

{'Student A': 89, 'Student B': 85, 'Student C': 93, 'Student D': 83}

In [82]:
pd.Series(d)

Student A    89
Student B    85
Student C    93
Student D    83
dtype: int64

In [83]:
exam2 = [74,56,44,92]

e1 = pd.Series(exam1,labels)
e2 = pd.Series(exam2,labels)

In [84]:
e1 + e2

Student A    163
Student B    141
Student C    137
Student D    175
dtype: int64

In [85]:
e1 * e2

Student A    6586
Student B    4760
Student C    4092
Student D    7636
dtype: int64

In [86]:
e1 / e2

Student A    1.202703
Student B    1.517857
Student C    2.113636
Student D    0.902174
dtype: float64

In [87]:
e1 / 5

Student A    17.8
Student B    17.0
Student C    18.6
Student D    16.6
dtype: float64

In [88]:
# data frame

In [89]:
df = pd.DataFrame({'e1':exam1, 'e2':exam2},index=labels)
df

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [90]:
df['e1']

Student A    89
Student B    85
Student C    93
Student D    83
Name: e1, dtype: int64

In [91]:
type(df['e1'])

pandas.core.series.Series

In [92]:
data = np.array([exam1,exam2])
data.transpose()

array([[89, 74],
       [85, 56],
       [93, 44],
       [83, 92]])

In [93]:
df = pd.DataFrame(data.transpose(),index=labels,columns=['e1','e2'])
df

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [94]:
df.shape

(4, 2)

In [95]:
df['e1']

Student A    89
Student B    85
Student C    93
Student D    83
Name: e1, dtype: int32

In [96]:
df.e1

Student A    89
Student B    85
Student C    93
Student D    83
Name: e1, dtype: int32

In [97]:
df['e3'] = [67,59,79,84]
df

           e1  e2  e3
Student A  89  74  67
Student B  85  56  59
Student C  93  44  79
Student D  83  92  84

In [98]:
df['semester1'] = df['e1'] + df['e2'] + df['e3']
df

           e1  e2  e3  semester1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [99]:
df[['e1','e2']]

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [100]:
df.loc['Student C']

e1            93
e2            44
e3            79
semester1    216
Name: Student C, dtype: int64

In [101]:
df[['e1','e2']]

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [102]:
df.loc['Student C']

e1            93
e2            44
e3            79
semester1    216
Name: Student C, dtype: int64

In [103]:
df.loc['Student C','e2']

44

In [104]:
df.loc[['Student C','Student D'],['e2']]

           e2
Student C  44
Student D  92

In [105]:
df.iloc[1]

e1            85
e2            56
e3            59
semester1    200
Name: Student B, dtype: int64

In [106]:
df.iloc[1:,1]

Student B    56
Student C    44
Student D    92
Name: e2, dtype: int32

In [107]:
df['e2'] > 70

Student A     True
Student B    False
Student C    False
Student D     True
Name: e2, dtype: bool

In [108]:
df[df['e2'] > 70]

           e1  e2  e3  semester1
Student A  89  74  67        230
Student D  83  92  84        259

In [109]:
df[df['e2'] > 70]

           e1  e2  e3  semester1
Student A  89  74  67        230
Student D  83  92  84        259

In [110]:
df[(df['e2']<50)|(df['e2']>90)]

           e1  e2  e3  semester1
Student C  93  44  79        216
Student D  83  92  84        259

In [111]:
df.drop('semester1',axis=1)

           e1  e2  e3
Student A  89  74  67
Student B  85  56  59
Student C  93  44  79
Student D  83  92  84

In [112]:
df

           e1  e2  e3  semester1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [113]:
df.drop(['e3','semester1'],axis=1,inplace=True)
df

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [114]:
df.reset_index()

       index  e1  e2
0  Student A  89  74
1  Student B  85  56
2  Student C  93  44
3  Student D  83  92

In [115]:
df_new_index = df.reset_index()
df_new_index

       index  e1  e2
0  Student A  89  74
1  Student B  85  56
2  Student C  93  44
3  Student D  83  92

In [116]:
df_new_index['student_name'] = ['Adrian','Bartłomiej','Celina','Dagmara']
df_new_index

       index  e1  e2 student_name
0  Student A  89  74       Adrian
1  Student B  85  56   Bartłomiej
2  Student C  93  44       Celina
3  Student D  83  92      Dagmara

In [117]:
df_new_index.set_index('student_name')

                  index  e1  e2
student_name
Adrian        Student A  89  74
Bartłomiej    Student B  85  56
Celina        Student C  93  44
Dagmara       Student D  83  92

In [118]:
df_new_index2 = df.reset_index()
df_new_index2

       index  e1  e2
0  Student A  89  74
1  Student B  85  56
2  Student C  93  44
3  Student D  83  92

In [119]:
df_new_index2.index = ['Adrian','Bartłomiej','Celina','Dagmara']
df_new_index2

                index  e1  e2
Adrian      Student A  89  74
Bartłomiej  Student B  85  56
Celina      Student C  93  44
Dagmara     Student D  83  92

In [120]:
df.rename(columns={'e1':'exam1','e2':'exam2'})

           exam1  exam2
Student A     89     74
Student B     85     56
Student C     93     44
Student D     83     92

In [121]:
df.rename(index={'Studnet C':'Student C'})

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [122]:
df.rename(str.upper, axis='columns')

           E1  E2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [123]:
df = pd.DataFrame({'A':[100,44,56,99,85,100],
                  'B':['Panda','Snake','Snake','Rat','Dog','Panda']})

In [124]:
df

     A      B
0  100  Panda
1   44  Snake
2   56  Snake
3   99    Rat
4   85    Dog
5  100  Panda

In [125]:
df['B'].unique()

array(['Panda', 'Snake', 'Rat', 'Dog'], dtype=object)

In [126]:
df['B'].nunique()

4

In [127]:
df['B'].value_counts()

Panda    2
Snake    2
Rat      1
Dog      1
Name: B, dtype: int64

In [128]:
df.sort_values(by='A')

     A      B
1   44  Snake
2   56  Snake
4   85    Dog
3   99    Rat
0  100  Panda
5  100  Panda

In [129]:
df.sort_values(by='A',ascending=False)

     A      B
0  100  Panda
5  100  Panda
3   99    Rat
4   85    Dog
2   56  Snake
1   44  Snake

In [130]:
df.drop_duplicates()

     A      B
0  100  Panda
1   44  Snake
2   56  Snake
3   99    Rat
4   85    Dog

In [131]:
exam1 = [89,85,93,83]
exam2 = [74,56,44,92]
exam3=[67,59,79,84]
df = pd.DataFrame({'e1':exam1, 'e2':exam2, 'e3':exam3}, index=labels)
df['semester1'] = df['e1']+df['e2']+df['e3']

In [132]:
df

           e1  e2  e3  semester1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [133]:
schools = ['High School X','High School X','High School Y','High School Y']
multi_index_list = [(school,student) for school,student in zip(schools,df.index)]
multi_index_list

[('High School X', 'Student A'),
 ('High School X', 'Student B'),
 ('High School Y', 'Student C'),
 ('High School Y', 'Student D')]

In [134]:
df.index = pd.MultiIndex.from_tuples(multi_index_list,names=['School','Student'])
df

                         e1  e2  e3  semester1
School        Student
High School X Student A  89  74  67        230
              Student B  85  56  59        200
High School Y Student C  93  44  79        216
              Student D  83  92  84        259

In [135]:
df.set_index([pd.Index(['High School X','High School X','High School Y','High School Y']), df.index],inplace=True)

In [137]:
df.loc['High School X']

                         e1  e2  e3  semester1
School        Student
High School X Student A  89  74  67        230
              Student B  85  56  59        200

In [138]:
df.loc['High School X'].iloc[1]

e1            85
e2            56
e3            59
semester1    200
Name: (High School X, Student B), dtype: int64

In [139]:
df.xs('High School Y')

                         e1  e2  e3  semester1
School        Student
High School Y Student C  93  44  79        216
              Student D  83  92  84        259

In [142]:
df.xs('Student D',level='Student')

                             e1  e2  e3  semester1
              School
High School Y High School Y  83  92  84        259

In [145]:
# Ćwiczenie

# Do tabeli przypisanej do zmiennej df dodaj kolumny: e4, e5, e6. Niech wektory tych kolumn odzwierciedlają wyniki 
# z kolejnych egzaminów w drugim semestrze Studentów A, B, C oraz D. Wyniki tych egzaminów niech będą losowane 
# z liczb całkowitych o zakresie 1-100 włącznie. Następnie usuń kolumnę semester1. Po wykonaniu tych operacji stwórz indeks hierarchiczny dla kolumn tabeli, tak aby jego najwyższym rzędem było oznaczenie semestru, w którym napisany był dany egzamin.